{"meta":{"title":"山水堂","subtitle":"二十年在一起","description":"","author":"Justin Wu","url":"http://justinwu1973.github.io","root":"/"},"pages":[{"title":"本博说明","date":"2020-12-08T06:43:15.000Z","updated":"2020-12-08T17:33:21.057Z","comments":false,"path":"about/index.html","permalink":"http://justinwu1973.github.io/about/index.html","excerpt":"","text":"从2004年女儿降临开始，一直陪伴她成长，感觉就是自己重活了一次。 高中进入国际班学习后，应TP升学老师要求，女儿自己开始学习搭建GitHub博客，TP刁老师怂恿我也建一个，以前玩过自己建站，有过filemaker相关的网页，也玩过新浪微博，对可视化搭建个人博客其实兴趣不大，但是在给女儿解决一些Mac相关的技术问题期间，反而自己掉进了这个坑玩的不亦乐乎。"},{"title":"categories","date":"2020-12-14T14:41:01.562Z","updated":"2020-12-11T16:34:46.000Z","comments":false,"path":"categories/index.html","permalink":"http://justinwu1973.github.io/categories/index.html","excerpt":"","text":""},{"title":"Repositories","date":"2020-12-11T04:58:36.502Z","updated":"2020-12-08T17:32:11.293Z","comments":false,"path":"repository/index.html","permalink":"http://justinwu1973.github.io/repository/index.html","excerpt":"","text":""},{"title":"标签","date":"2020-12-14T15:30:47.458Z","updated":"2020-12-08T16:44:30.475Z","comments":false,"path":"tags/index.html","permalink":"http://justinwu1973.github.io/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"第一章 青年期的课题与自我的形成【日高伦理】","slug":"21-02-24JHEthic1-1","date":"2021-02-23T16:00:00.000Z","updated":"2021-02-24T14:07:09.038Z","comments":true,"path":"2021/02/24/21-02-24JHEthic1-1/","link":"","permalink":"http://justinwu1973.github.io/2021/02/24/21-02-24JHEthic1-1/","excerpt":"","text":"第一章 青年期的课题与自我的形成 即将成人，但还未成人的你们， 现在身处何处呢？ 说长也长，说短也短的人生旅途。 那里有什么样的困难和什么样的喜悦， 要翻越什么样的山峰呢？ 首先，让我们从注目“现在”开始， 确认青年期的定位与特征，思考青年期的课题。 对于跨越烦恼多多且又光芒四射的人生的这个季节的你们来说， 这是为了探求今后更丰富的生活方法。 我们的“现在” 活在“此时”“此地”的我 ​ 看一下我们现代高中生的生活吧。虽然贫富分化社会的到来已经很久了，但是身边的”物质“依然是丰富的。即便是高中生，也可以通过打工获得相当的收入。大人们或者是因为忙，或者是失去了自信，最近也不怎么啰啰嗦嗦了。 ​ 看上去象是在这样讴歌自由自在的每一天，然而年轻人中间却似乎飘荡着一种难以言喻的闭塞感。做什么都可以，全部依靠自主性，话虽如此，但是决定该做什么的还是自己，因为隐约能看到被追问成果和责任，所以毋宁说可以自由地任意选择甚至反而成为了沉重的负担。不能自主行动，要等待指示，做事松松垮垮，大人们会这样批评，然而在这样的言行的另一面，也能看得出孤独与不安。虽然异口同声说着”朋友最重要“，有时候却还是会觉得郁闷。通过随时随地都能联通的网络建立的人际关系的烦恼也越来越深刻。萨特所说的“人类被处以自由之刑”，越发显示出强烈的现实性。 ​ 人类的“智慧之力”已经孕育出可以把这个地球夷为废墟数次的科学技术。最好的例子就是，2011年3月11日，东日本大地震以及随之而来的核电站事故，让我们亲身体验到了我们坚信不疑的今日之后还有明日的日常生活可以破坏于一瞬之间。如今，我们不得不重新审视我们尽力描绘至今的世界蓝图，关注、思考被我们忽略的事物。 ​ 即便如此，在如此前所未有的事态中，还是有多少人奔赴灾区尽一己之力，其中也有青年人的身影。从这种非常态中表现出来的人与人的关联、互相支持的姿态、真正重要的可靠性、绝望中编织出来的希望、关于未来的可能性，我们希望能找到“现在”“在这里”生活的“我”能运用到日常的生活中的各种方法。这是因为，非常时期在让平凡的日常散发出不可替代的光辉的同时，平凡的日常也支撑着非常时期。 第一节 青年期的意义 人类在青年期会遭遇种种变化，既会感受到面对新世界新体验时的巨大魅力与喜悦，也会感受到迷惘与痛苦。青年期的意义就在于以这种摇摆为精神食粮进一步成长。 现代的青年 变化的社会与青年期 这个时代被称为难以成人的时代。成为成年人的条件之一是经济、社会性自立，然而周边的社会环境现在已经发生了重大的变化[1]。从学校毕业后就获得稳定的职位，基于终身雇佣与年功序列工资的稳定感建立家庭并养育后代。象这样在过去标准化的人生，现在却前途迷茫，看不透未来。并且，在全球化和产业成熟化的背景下，作为“社会人”要求的能力复杂化、高度化，有必要终身进行多样化学习。 家长和老师有没有跟你说过？“这是你自己的人生，你怎么喜欢怎么来”。随着价值观的多样化，模范榜样不复存在，关于升学和就职，我们不得不依靠自己的价值标准来进行选择。而且，之后可能会发生的类似失业或者个人破产这样的风险，虽说应该是社会作为共同体来加以应对，然而却有个人自己承担责任的倾向（风险个人化）。应该有不少青年抱着不安反复追问自己到底想做什么，自己的选择正确吗。 关联与承认的意义 成为成年人的必要条件，不是能自己赚钱养活自己，自己的社会存在意义为他人认可的经验也是必不可少的。但是，现代社会中，随着就业的困难，不仅仅引发了经济上的困境，也引发了陷入社会关联丧失状态的所谓社会性排除的问题。如今，青年通过各种各样的社会参与建立与他人的关联并予以相互承认，建立这样的场合意义重大。 青年期的定位 从儿童到成人的过渡期 青年期是由儿童到成人过渡的重要时期，然而过去儿童是经由成年式[2]或者婚礼这样的通过仪式[3]（initiation）一下子转变为成人的，并不存在青年期。同时，在中世纪的欧洲，甚至连“儿童”都不存在[4]。青年期的存在，始于18世纪后半至20世纪初，其原因，是为了近代产业发展，需要为成人而做好准备。该青年期因与之前的儿童期相比有质变的发展，也被称为“第二次诞生”的时期。青年期在早期，仅有2~3年的长度，随着就学时间延长、身体发育提前化（发育加速现象）、晚婚-非婚化等现象的产生，现在已经延长到了十数年，占据了生涯（life cycle）中的大部分。 第二次诞生 我们可以说要诞生两次。一次是为了存在，一次是为了生活。一次是作为人类的一员，一次是作为有性别的人。......在思春期之前......女孩子也是儿童，男孩子也是儿童。......他将于自然确定的时期脱离那种状态。而这个充满了危险的时期虽然相当短暂，其影响却相当悠长。......他会开始记得低垂双眼两腮发红；还不明白感受到什么东西，就已经开始感受了；虽然不明所以，就已经开始烦躁不安了。...... 这就是我刚才说到的第二次诞生。这才是人真正降生到人生的时候，人类的所作所为从此不再与他无缘。​ ------------------摘自卢梭《爱弥儿》 青年期的延长与其区分（据笠原嘉及其他 《青年的精神病例1》1976年） 青年期的年龄区分有种种考量，此图显示了其中之一。 成为成人的缓冲期 根据美国文化人类学者米德（M.Mead 1901-78)的报告：儿童的世界与成人的世界无甚分别的社会，由儿童向成人的发展是持续且平稳的。然而，产业化与信息化发达的社会，儿童的职责与成人的职责存在差异与对立，由儿童向成人的发展存在非连续性的台阶。青年虽然在各方面的能力得到提升，已经不再是儿童，然而在很多方面也还未能完全成人。这种处于成人与儿童之间微妙的结合部的青年，德国心理学家列文（K.Z.Lewin）称之为Margin man（边缘人、边界人）。 青年要作为合格的社会人发挥作用，需要发展各种知识和能力，需要心理性和社会性的成长。为了给这种发展和成长以时间，青年在各种社会性的责任与义务方面是得以缓冲的。美国精神分析学者埃里克森(E.H.Erikson)将青年的这种状态称之为心理与社会性延期履行[5]。原本在此延期履行中被期待的以成为合格的成人为目的而积累的禁欲化的努力与修行，随着昭和40年代（70年代）后半大学斗争的平静化以及大学大众化的进一步发展，放弃了这样的努力、追求满足欲望和发泄情感、对真实社会失去关心沉湎于个人世界的青年大大增加。而进入平成时代（90年代）之后的萧条持续与就业困难之中，也有为了融入现实社会而过度适应的青年。虽然存在此类对于延期履行的消失和形式化的批判，但是延期履行还是有必要保持其本来面目。 3.青年期的特征 多样变化的时期 青年期可见各种发育性的变化。身体方面，身高体重急速增长（青年期加速）、出现第二性征[6]。更进一步，思考能力、自我意识等心理性方面、亲子关系、朋友关系等社会性方面也会出现变化。 高中时期处于青年期的中段，对身体上的变化产生的迷惑少于初中时期，转向对内层的精神世界的关心，对自己的生活方式及人生的思考增加。其次，经历过初中的第二叛逆期，心理方面进一步与父母分离并独立(心理断乳)，由求助于父母转向求助于支持自己并能为自己保守秘密的朋友，扩大兴趣爱好和行动的范围，以此拓宽面向社会的视野。尤其是友情与爱情为青年的生活增添了丰富的色彩并促进了成长。 另一方面，也存在容易碰壁与挫折的特征。有的青年沉湎于内心世界、脱离现实无法自拔于一己的钻牛角尖或者感伤，或者囿于利己、为激情推动作出冲动行为，也有青年因社会和成人与自己的理想背道而驰而失望低迷，或是因自己受到批判的审视而抱有罪恶感或低劣感。 以互联网为代表的信息化发展到现在，青年中也可见孤立个体的变化。一方面存在对缺乏同情心和社会性、不愿成长的倾向的指摘，另一方面，友好直率、环境意识的提高、积极参与志愿者活动等等，学校教育也是成果斐然。 青年期生理、心理、社会性各方面发育 1. 心理发育： 抽象、逻辑思维的发育，对于自身的认识和知识、思考能从自身以外的立场出发的认知能力的发育，能根据 记忆材料的意义进行关联和总结的记忆模式的发育。 自我、自身意识的发育 情绪性特征的变化（出于虚荣心和羞耻心的压抑情绪、变脸等。在欢喜与被爱、得意与失意等极端情绪之间摇 摆等） 2.生理发育： 身高、体重的急速增长与第二性征的出现。 3.社会性的发育： 第二叛逆期的出现（对自立的需求增大的结果，对父母、师长等成年人的拒绝、反抗）。 亲子关系、朋友关系、社会性立场的变化。 自我的发现 德国哲学家、教育学家斯普兰格(E.Spranger)说过：在深深的孤独中，没有人比青年更渴望接触与理解了。青年在期望他人理解自己的同时，却也会隐藏自己的本心。这是因为通过青年期的发育，青年的自我(ego)[7]开始觉醒。所谓自我觉醒是指觉察到自身的自我的存在，发现自己是独立于身边世界的单一的主体化存在。通过觉醒发现的内心世界里，有着善与恶、愉快与不快、强与弱、爱与憎、自信与不安、美与丑等相对的矛盾（二元价值）的方面。这是无可替代的自己的重要世界，同时也是自己想要回避的世界。因此，在追求对自己的理解的同时，也会因为可能被理解而产生抗拒，或是坚持认为别人不可能理解自己的情形。 自我觉醒的青年会产生“我是谁”、“为什么我存在于此时此地”这样的关于自我的存在的意识体验（自我体验）。因而既抱有理想和希望，同时也会感受到体验孤独、矛盾地觉察自己的弱小丑陋、对自身的对立矛盾的苦恼。自我体验的契机，可能是镜中自己的映像、亲近者的亡故、朋友的分离、朋友的背叛或误解、应试相关的学习和竞争、父母的责骂等等。自我体验时体会到的感情以负面居多，由于自我体验可以促进青年的发育，其后的变化则以正面居多。 深刻感受这种自我体验，不回避包涵矛盾的自己的形态，如实接受，才能由此了解自己的内心，才能进一步了解他人的内心。产生对他人的同情心、同感，与他人共同生活的自觉，即由此产生。 写在最后 伦理课的第一章第一节如上。 这一节中提到的一些心理学意义存在共性的问题，比较在意的就是社会性排除为代表的青年与社会的沟通问题。即文中提到的：青年通过各种各样的社会参与建立与他人的关联并予以相互承认，建立这样的场合意义重大。 如果说在日本，高中生与社会关联还算比较自由且畅通的情况下，换句话说，从心理角度出发日本孩子比中国孩子更正常更健康的情况下，正常的高中生还会产生这样的问题，那么在中国现行的教育体系中勉强生存下来的孩子们的心理健康会是什么样一种状态？不问可知。 这就是我之所以要投身于亲子关系的沙龙分享的原因，其实，毋宁说是更关心青年的思想工作。 我还记得自己14岁那年半夜偷偷起床准备离家出走去参加文学社的冬令营，外婆在床的另一头悠悠长叹，起来塞了20块钱在我兜里，又把毛线围巾套在我脖子上。倔强的少年闷着头义无反顾地冲出了家门。30多年过去了，当时的倔强少年终于回忆起那天黎明凛冽的寒风中脖子上顽强缠绕着的那缕温暖，当时却毫无知觉。极其幸运的是，虽然当时的倔强少年背叛了家庭亲情，却收获了友情与师长恩情，最终摆脱了自闭与自卑，成为了一个身心健康甚至可以自夸优秀的青年。 这一切都是真实发生的，所以30年后我会在这里总结道：无论如何，必须保证内心与外界交流的通道，任何时候都要保证有人可以跟你倾心交谈。 少年啊，如果自我觉醒真的那么容易，而且还能千人一面，那青年这种生物不就跟啃的鸡一样可以在孵化场里批量生产了吗？ 少年啊，倔强只是一种情绪，过去了就没有了。即使是扮演孤独清高，小心思里是不是偷偷在背后很远的地方放了一个忧伤地默默地崇拜并心疼着你的小丫头呢？ 哎呀哎呀，谁叫我30年前也是那样的一个少年呢？所以我怎么会不理解你的小心思呢？所以，你总能找到这么一个长大了的孩子可以听你说说话、陪你聊聊天的嘛...... 那就算打游戏也可以啊，打不过你我还可以氪金嘛...... 如果读者君是教育工作者，请留下一颗种子在心里，那个孩子可能就是上面描述的那个渴望理解的青年。 如果读者君是家长，请留下一颗种子在心里，你的孩子可能就是上面描述的那个正在痛苦断奶的孩子。 如果读者君是学生...... 那么 走吧 上山，下海 世界这么大 我们才是种子 要在全世界 生根，发芽 泡沫经济崩溃的1990年代后半，萧条中的企业压缩应届生招聘，年轻的非正式雇员（编外员工及临时员工）大量增加。 ↩︎ 由儿童而成人的社会地位转换仪式。男孩子的元服，女孩子的削鬓等。 ↩︎ 为安全通过人生的节点，地位转换而举行的仪式。日本现存参宫式、七五三、入学式、入社式、成人式、结婚式等。 ↩︎ 法国历史学家阿里埃斯（P.Aries 1914-84)：如今的与成年人有所区别的儿童的概念，诞生于13世纪至17世纪之间，之前的幼儿长至7岁左右即成为工作游戏均与成人一起的“小大人”。 ↩︎ 延期履行原本为经济学术语。因灾害货恐慌等非常时期，暂缓执行债务的偿还，或指其暂缓偿还的时期。埃里克森用以表达青年期的特性。 ↩︎ 出生时即具有的男女身体差异为第一性征，胡须和骨骼之类成年男女的身体形态的差异为第二性征。第二性征发生于青年期。 ↩︎ 所谓自我，是指综合了认知、思考、感情、意志、意识等精神机能的心灵中枢。自体在作为意识的对象时称为自己。 ↩︎","categories":[{"name":"分享","slug":"分享","permalink":"http://justinwu1973.github.io/categories/%E5%88%86%E4%BA%AB/"}],"tags":[{"name":"教育","slug":"教育","permalink":"http://justinwu1973.github.io/tags/%E6%95%99%E8%82%B2/"}]},{"title":"序言【日高伦理】","slug":"21-02-22JHEthic","date":"2021-02-21T16:00:00.000Z","updated":"2021-02-22T04:21:26.382Z","comments":true,"path":"2021/02/22/21-02-22JHEthic/","link":"","permalink":"http://justinwu1973.github.io/2021/02/22/21-02-22JHEthic/","excerpt":"","text":"序言 ​ 我们常常会思考类似活着的意义这样的问题。又或者会想：自己正在做的事情怎么会觉得没有意义，这样下去好不好。 ​ 但是，实际上我们在热衷于某些事情时并不会如此思考。沉浸于足球，出神于音乐，这种时候是不会自问我是为了什么在做这些事情、这些事情有什么意义的。无疑，此刻只是忘我投入享受当下而已。活泼泼地活着的时候，就是这样而已。 ​ 因此，可以的话不去思考也行。其实也可以说，可以不去思考而沉浸其中、为之努力，这样的事物能够拥有多少，是决定了其人生的丰富程度的。 ​ 然而，问题在于，我们不一定就能一直顺利。那是因为，我们既非绝对也非万能，我们是有限的存在。因此，就有对思考的需求。会产生通过思考，让我们努力变得更好的需求。 ​ 所谓伦理，就是追问思考”更好的活法“是什么、自己是什么、人是什么这样的问题的范畴。思考，绝不是玩弄抽象的各种思维方式。诗人长田弘曾经这样说过：“所谓思考并非讲道理，而是深入感受。不培养自身深入感受的能力，我们什么也看不到......” ​ 而同时也绝对必要的，就是“学习”的态度。有言：“学而不思则罔，思而不学则殆。（论语）”，只有通过学而思、思而学，才会收获自己更好的人生。 写在后面的前言 自从参与了两次亲子关系的沙龙，我开始思考一些相关的问题。 家长们早已成人，三观也早就固化，不属于思考的对象，然而孩子们不同，他们的三观培养，是重中之重的话题。 以我家中等偏上的育人经验，从幼儿园时期开始直到今天，这10年以来，一直没有进行过系统的通识教育。毋庸讳言，就是在我身边也就存在着教育失败的实例。细思极恐，孩子们似乎连活成个正常人的机会都在被各种兴趣班、补习班、大考小考这些侵蚀着。当下我接触到的孩子们，或多或少都存在着这样那样的三观问题，那么，家庭矛盾、亲子关系，暴露出问题甚至是深刻的问题，不就是非常正常的事情了吗？ 16岁，花一样的年华，本应是好奇心求知欲最旺盛的年纪，然而，我们给孩子们提供过、提供着、能提供多少求知的空间？用序言里的话，我们的孩子在想些什么？怎么想的？我们真的确定知道吗？孩子们沉迷网络、沉迷游戏、各种迷惘、各种叛逆。他们不是无聊，是无物可聊啊。 知识一道，除了加减乘除ABCD子曰诗云之外，还有许多。比如追求真善美，比如探索因为所以，比如观察创造。真正的软实力，其实也在序言中：学而思。这是说的能力问题，学习能力和思考能力。其实，从我接触到的孩子们身上，我早就发现了理性的光芒。他们并不排斥思考，也不是对游戏以外全无兴趣。我敢拍胸脯保证的是即便让孩子们去上哈佛的哲学课，他们也绝对不会完全莫名其妙。所以这里重复一下，孩子们是拥有学习能力与思考能力的，剩下的就是内容了。我们需要做的就是如何给他们提供一份靠谱的书单或者说思想的导游图。 然而内容最难。 热衷于上网找书单领鸡汤的做法，可谓冬天的萝卜，包治百病，包你治出一百种毛病。知识以及寻找知识本身并没有问题，问题在于这种书单鸡汤只是罗列，根本不可能全部读完，最大的可能是孩子们看了书单的介绍就已经想吐了。而我们的通识教育尽管这几年已经有了相当的改变和长足的进步，但还是处于体系分散、内容不完善、面向中高考、教学僵化等严重的问题。孩子们要怎样才能在这种混乱中找到一条通识教育的路呢？ 在日本的高中教育里，伦理是一门选修课，入学考试也不会考，所以，其实也是一门边缘化的学科。为什么要花大代价专门从日本找来这本教材呢？就是因为它涵盖了历史、哲学、艺术、社会、经济、政治、法律等几乎所有“做人，做个好人”的内容，堪称纲领。推介这个课本，不是要包治百病，只是提出一种思路，相当于没有书名的书单。要旨就是，人类的历史和社会中，曾经产生过、现在存在着这些那些美妙的思想，世界是如此之大、历史是如此之长，艺术是如此之美，而人生可以如此之善。只要能引发一些兴趣，一些思考，就已经足够。 同时，为什么是选编，日本高中教材，必然以日本国情为准绳，内容中包含大量的日本历史与文化，这部分我会在碰到的时候加以选择，以飨读者。 最后的最后，突然想到，无论艺术、历史、宗教还是主义，这些都属于思想的范畴，本书的体例大概勉强可以称得上是思想简史了吧...... 但愿有小读者愿意进来看一眼，开卷有益。","categories":[{"name":"分享","slug":"分享","permalink":"http://justinwu1973.github.io/categories/%E5%88%86%E4%BA%AB/"}],"tags":[{"name":"教育","slug":"教育","permalink":"http://justinwu1973.github.io/tags/%E6%95%99%E8%82%B2/"}]},{"title":"2月6日第二次沙龙  聆听","slug":"21-02-06 Salon 2nd","date":"2021-02-05T16:00:00.000Z","updated":"2021-02-07T16:14:54.000Z","comments":true,"path":"2021/02/06/21-02-06 Salon 2nd/","link":"","permalink":"http://justinwu1973.github.io/2021/02/06/21-02-06%20Salon%202nd/","excerpt":"","text":"在刺激与回应之间，有一个空间。 在这个空间里，我们拥有选择如何回应的控制力。 而我们如何回应则决定了我们的成长与自由。 ​ -维克多・E・弗兰克尔 写在前面 过去的一年里，相信每个家庭都多少体验了一些苦难的时刻。进入新的学年以来，身边又发生了几起高中生弑母这样的悲剧，虽然不是发生在自己身上，却也深受震撼。 经历过风雨，彩虹却不一定能见。带着累累伤痕，孩子和我总算是凭着残存的本能走出了阴霾，余悸未消，庆幸之余，我不禁陷入了沉思。孩子，我们，究竟该从这一场鏖战中收获一些什么？ 我们，到底需要什么？ 带着这个疑问，我开始了与乐意妈妈以及乐意妈妈介绍的心理专家芋头老师的接触，最终有了2021年春节前的这一场沙龙，这一场无关升学、不谈功利，却收获了数年来前所未有好评的亲子沙龙。 不围绕主题 这一次的沙龙总结，我也打算不循惯例。不做介绍、回顾、归纳、总结，而是以一个观察者的身份，从活动的侧面，来述说一些沉浸式的感受。 之前 首先是策划孩子板块的活动与家长板块的活动，策划组之前就沟通了很久。说实话，安排学长到场为孩子们解读院校专业，是所谓”干货“，就是为了吸引孩子们参与到沙龙中来，只要孩子们到场，家长基本上是肯定会跟着来的，那么家长板块的出席率也能得到一定的保障。 为什么？大家不妨扪心自问。大多数的国高家庭，不论是孩子还是家长，其实都存在不同程度的功利心，目的非常明确。跟升学无关的活动，都是可有可无的，怎么可能吸引到参与者呢？ 然而，什么是与升学有关的活动呢？标化，比赛，文书要用的活动......于是，孩子刚从中考的烽火硝烟中生存下来，就又要带着累累伤痕背负铁甲再次走向下一个险恶战场，而为人父母者也是紧咬牙关一边恶狠狠地告诉自己再熬两年就到头了一边手握皮鞭与长矛开始了下一场冲锋...... 所以，策划组也不得不流于俗套，在提供干货的同时，顺便推销一下“私货”。当然，你也可以理解为挂羊头卖和牛，而且是5A级的松坂牛。 策划组在确认了沙龙的形式之后，就把目光落在了沙龙的主题上。事实上，在元旦沙龙的期间与之后，我们就敏锐地捕捉到了来自孩子们和家长们的无线电波。来自沙龙参与者以及外部的信息，表明了孩子们与家长们其实对亲子关系这方面心理咨询的需求是客观存在的。从某种意义上来说，家庭成员的心理健康问题的解决，甚至已经到了迫在眉睫的程度。策划组在第一时间就把亲子关系定为本次沙龙的主题。 于是，就有了这次沙龙的策划方案，题中应有之义，却落在了题外。 期间 随着活动的展开，孩子们在没有家长老师参与的小房间里自动嗨起来。正应了那句话：“只要家长老师不在，一个个都是活蹦乱跳的。” 家长们在芋头老师的娓娓而谈中也为下一场工作坊做好了心理铺垫。 活动的过程，讲座的内容，在此不做赘述。重点描述一下工作坊。 尽管策划组之前对活动有了一定的预期，但是芋头老师在活动前夜抛出的杀手锏确实叫所有人吃了一惊。 Lumina Spark地毯评测，这是本次沙龙亲子共同参与的除升学分享与亲子关系讲座之外的第三板块亲子工作坊的活动的正式名称。绝大多数参与者是第一次接触这个类似团建游戏的评测，叫我惊掉下巴的是，参与度如此之高，效果如此之好，如此被接受，如此被好评，这在活动策划期间，是彻底被低估了的。 除了芋头老师公认的心理导师、教练的功力之外，我也体验到了全体参与者散发出来的那种氛围：久违了的自由与轻松。因此，轮到我发言的时候，我把这场活动评价为近期以来最棒的一天。 之后 活动结束之后，策划组进行了复盘。复盘也吸纳了家长代表和学生代表，大家欢聚一堂畅所欲言，显然还沉浸在活动的余韵之中。在充分肯定了本次沙龙的效果之余，也对下一场沙龙的主题与形式作出了预期和规划。 接下来，就要开始这次沙龙不那么正经不围绕主题的总结了。 芋头老师在沙龙结束的时候，给出了本文最上面的那段话。十二个时辰之后，这段话依然萦绕在我的脑海，最后浓缩成了两个字：空间。 成长与自由是人生的目标，即便有些笼统或者模糊，但是目标本身是不会动摇的。而如何实现目标，却是当下不得不思考与解决的问题。重点就来到了空间这两个字上。 刺激，来自外界。回应源于内心。这两者之间，即为空间。 学习、考试、升学，这些就是来自外界的刺激，甚至可以算上父母的念叨或者呵斥。 沉默、无视、反抗，这些都是源于内心的回应，或者不能除掉孩子的轻蔑甚至暴走。 细思极恐的是，关注到孩子的心理健康的时候，我观察得出的结论是：现在孩子们在外界的刺激与内心的回应之间，几乎没有剩下多少空间。换句话说，孩子们的成长与自由已经剩不下多少弹性了。 从日常角度去看，早上6点起床，早饭，赶路，进学校，5点离开学校，赶路，进机构标化学习，9点下课，继续赶路，回家写作业，三更半夜上床睡觉......然后开始下一个循环。哪怕有一些空，也要被社团、竞赛、补课、手机游戏这些必须的项目填满。 回想自己当年，几乎每天下课路上约上三五好友去绍兴路三联书店蹭读，或者是每周参加两次文学社自由写作，周末还可以去游戏机房当首通演示免费打游戏，还有时间去米店油店煤店排队购物为家庭出力。虽然看上去有些野生，但那个时代难道不是充满了自由的气息可以狂野生长的时代吗？ 反观现在的孩子，成绩=来自家长的压力，活动=来自家长的压力，升学=来自家长的压力。焦虑堆积的当下，每一种刺激都要求即时的回应，回应不能满足要求，意味着更进一步的压力。我们给孩子们留下了多少空间？我们剥夺了孩子们多少自由与成长的空间？ 没错，缺乏空间，就是孩子们现在最为突出的心理健康难题。 既然缺乏空间，那就设法补救。 禅宗著名的故事，被老虎和狮子逼入绝境挂在上不得下不去的悬崖上的那个农夫，摘下身边的那朵花大声赞叹：好香啊。 前一阵上映的动画片心灵之旅，那个几千年不肯投胎的灵魂最终在那片飘落的树叶上找到的生命意义大道至简：好好活着就是生命的意义。 我们能不能为孩子们献上那一朵花、那一片叶子？或者说，我们自己也同样需要那一朵花、那一片叶子？ 暂时放下牛剑，暂时忘记雅思托福，暂时丢掉AMC，一家三口去玄武湖散个步如何？周末在家一起做一顿好吃的如何？大家一起读一本好书？聊聊音乐？谈谈人生？如何？如何？ 这一切不都是如此简单的美好吗？ 写在最后 金中剑桥班让我们走到了一起，我们就是一个大家庭。所有的孩子就是我们的孩子，所有的父母都是兄弟姐妹。在活动的现场，那么多可爱的孩子，那么多可爱的兄弟姐妹，我只能用一个俗套的说法来形容当时的感受：感觉身上暖洋洋的。 这次沙龙给了我如此大的冲击，以至于我灵感有如泉涌。 除了每月沙龙正在规划的活动，策划组今后可能还会策划读书会文学社这样的小组活动，我甚至还异想天开脑补了一下美食教室：生活在海外的学长是如何解决吃饭问题的呢？我们是不是可以按照海外超市日常提供的食材种类，安排一批简单又健康的食谱，让孩子们一起来弄一顿好吃的以后出国留学不至于成天被麦当劳和炸鱼薯条迫害？还有舞会，还有...... 一路写到最后，突然，之前跟那个谁说过的那句话又回到了我的脑子里：其实，少年郎、小姑娘，一眨眼就都长大了，我们不是理所当然要重新构造一个健康的社交空间让他们能认识并获取真正健康的自由与成长吗？ 这句话已经说过有一段时间了，庆幸的是得到了芋头老师的印证与加持，我心窃喜，故录于此，与诸君共勉。 至此，本次沙龙的不正经文字版总结彻底完结。 再次感谢芋头老师、李慧老师、高蕾老师、袁乐意同学、洪钰梓同学、皋子喻同学。是他们无私的分享，为我们打开了那扇窗。","categories":[{"name":"升学","slug":"升学","permalink":"http://justinwu1973.github.io/categories/%E5%8D%87%E5%AD%A6/"}],"tags":[{"name":"亲子","slug":"亲子","permalink":"http://justinwu1973.github.io/tags/%E4%BA%B2%E5%AD%90/"}]},{"title":"2021年1月3日亲子沙龙","slug":"21-01-05Salon21-1-3","date":"2021-01-05T05:00:00.000Z","updated":"2021-01-05T11:50:48.472Z","comments":true,"path":"2021/01/05/21-01-05Salon21-1-3/","link":"","permalink":"http://justinwu1973.github.io/2021/01/05/21-01-05Salon21-1-3/","excerpt":"","text":"写在前面 进入国高已经小半年了，各种技术性分享也做了不少次。最初的迷惘和焦虑逐步消失或者变质，新的迷惘和焦虑又在不断产生和形成。刚性的需求与进程绝大多数国高家庭都能按部就班，然而一些软性的隐性的问题也随之逐渐显现。 处于青春期的小儿女们似乎一夜之间就真的长大了，尽管仍然带着一抹倔强的青涩，然而为人父母者却仍然或迟或早地遇见了人生的又一个第一次——第一次败给了突然长大的儿女。 没有跟孩子吵过架的父母一定是外星人，这个判断一定是准确的。绝大多数的家庭吵吵也就算了，毕竟最后都能挺过去，活下来，而且未必就有什么不良的后果近期就会出现。然而，国高家庭却有所不同。站在第一学期的尾巴尖上前瞻后顾，即将来临的期末考试、雅思正课结束、刷题段开始、寒假补习、3月的第二学期期中考试、4月的雅思首考、5月的IG大考、活动、社团、夏校、升学方向......一项项都密密排在日程上，怎么还可以让亲子之间的冷战热战占据宝贵的时间与空间呢？ 于是，经过多方探讨，金中剑桥2020级家长帮得到了大师姐袁乐意母女、TP刁老师、芋头老师等各方面的大力支持，于2021年元月3日隆重推出了一个崭新的交流活动：国高家庭亲子关系线下沙龙。通过对升学机构、前辈家庭、心理专家的访谈与交流，探讨国高家庭亲子关系问题。15组家庭参与了这次活动，父母子女共聚一堂，认真总结了小儿女们跟爹妈斗智斗勇的经验教训，指明了现阶段和下阶段斗争的核心与方向，取得了丰硕的成果。现场气氛热烈，一双双年轻或成熟的眼睛不时闪现欣喜的光芒，活动取得了圆满的成功。 第一板块：TP刁老师的一封信 刁老师收到的这封充满了委屈与激愤的孩子对父母的投诉信，第一时间就收获了现场孩子们的星星眼：原来跟老爹老妈吵架还可以有这样的方法呀。 孩子与父母正因为一路走来自然形成的缺乏缓冲空间，一旦产生矛盾与冲突，往往就是亲情的小船说翻就翻。船小，风浪大，船上又是人挤人，换桨接舵中间举手投足稍有不慎，可不就是说翻就翻嘛。 说到换桨接舵，孩子们自信满满准备接手，然而父母却总是不放心不松手，于是都“同时站在了操作层面上”，这就是说一家人都站在了船的一边或船尾，不说抢舵抢桨时候要打起来，哪怕不打，小船也很难不翻。 其实，小儿女们已经开始脱去青涩，虽然还比不上“我吃盐多过你吃米”的父母，他们的逻辑思维也正在以超乎父母想象的速度逐步形成。因为缺少社会的磨砺，他们的逻辑甚至更为直接与锋利。诉诸感情与威权，既然不能作为成年人之间思想碰撞的手段，那么同样也不能适用于与孩子之间的逻辑思维的碰撞。身为父母，首先必须接受这一点，自己面对的是一个开始和你讲道理的准成年人，如果自己不打算跟ta讲道理，那么还怎么指望ta会跟你讲道理呢？ 同样，有意识地培养自己的逻辑思维能力，也是正在努力成人的孩子们在以平常心去与这个世界进行对话的过程中亟需获取的。身为孩子，也需要接受这一点，自己面对的是“吃盐多过我吃米”的成年人，如果希望ta们跟自己讲道理，那么自己是不是也就要跟ta们讲道理呢？ 重要的是，操作层面上除了一些刚性的议程，更多的其实是一些开放的选题，并非to be or not to be或者you or me的那种刀光剑影的关系。刁老师举了罗胖的一句话作为注脚，关系即本质。国高家庭亲子关系的本质就是携手让小船驶向星辰大海，那么在这个过程中，老船长不是应该放心大胆让小水手去试着掌舵，而小水手不是也应该认真向老船长学习六分仪的使用方法吗？ 小水手们在对CEO的角色认知上，提到了领导力、组织力、时间管理能力、执行力等等，刁老师补充了坚持与全面，也重点提到了责任。身为未来的船长，清醒而全面的自我认知、环境认知，对自己对团队（这里的语境就是指家庭）的责任心，其实都是舵把子上沉甸甸的那些重量。老船长不肯放手，小水手肯不肯想一想，老船长是不是因为ta自己都觉得这副担子的沉重而担心你可能一下子被压扁而不放心一股脑就把担子丢在你肩膀上呢？ 老船长们也可以放下面子，我们都是第一次来到这片崭新的海域，不需要讳言。我们也需要承认，我们的经验在这片海域，真的不一定管用了。承认这一点，才有可能去站得更高，看得更远。 聆听，永远是来自双方的。紧紧挤在一条小船上的老船长和小水手，能不能不要象一块领土上的老狮子和小狮子一样为了抢地盘而互相撕扯。让小船平稳驶向星辰大海，需要的是合力、合作、和谐。 第二板块：袁乐意母女访谈 随着一个个具体而平实的话题展开，乐意和妈妈带着我们一点点地回顾了那几年的生活。 学习、标化、社团、活动，乐意同学娓娓道来。看得出来，乐意同学的三年国高生活还是比较顺心顺意的，似乎并没有象我们预料的那样战火纷飞，也许这就是我们理想中的国高生活状态。 乐意妈妈的状态似乎也有一点出乎预料，她对乐意的全方位支持，与乐意之间似乎形成了一种相当和谐的状态。这一点贯穿了整个访谈，也许这就是我们理想中的国高家庭亲子关系。 当然，这一对母女之间也有不同的观点。乐意认为她和妈妈之间基本不存在什么冲突与矛盾，而妈妈在几年后听到乐意的这个说法反而吃了一惊。随着幕前幕后的访谈展开，我们看到了来自母女双方的智慧。乐意也许会比同龄人成熟得更早一些，但是主持人揣摩到了她对妈妈成功地施展了心机，而妈妈也接收到了这种心机并作出了积极的回应。具体地说，乐意是一个耐驮、温和、让人放心的孩子，其实这背后隐藏的品性是清醒的自我认知、强大的自我坚持、有效的交流技能。用妈妈的话来说，乐意是一个很有主见的孩子，面对潜在的矛盾与冲突，大多是乐意一开始就用软磨硬泡的手段有效地把可能爆发的战争扼杀在了萌芽状态。当然，妈妈能够充分听取乐意的意见，并且积极做出配合调整，甚至不惜牺牲自己物质和精神上的领地以及教书育人的乐趣，也是亲情的小船乘风破浪的成功秘诀。 从亲子关系角度出发，我们从乐意和妈妈身上看到了有效交流的实例。现场的家长和孩子相信都感受到了榜样的力量。自我认知、自我坚持、全面的责任感，孩子成功地进入了准船长的角色；自我认知、充分信任、协调能力，家长也成功地实现了大撒把的角色转换。开开心心地跟父母花拳绣腿地过招，与痛心疾首招招到肉一地鸡毛相比，如何选择，岂非一目了然？ 老船长和小水手要想把小船平稳驶向星辰大海，作为“吃盐”的老船长，不如主动让出书房，给小水手一点空间去施展手脚，展示他们在心智和技巧上的青涩成熟，抓大放小，适度放权，让小水手们逐步承担起自己的责任，在对自己负责的过程中去进一步发展自己的能力，由此形成良性的循环，恐怕这才是良好亲子关系上路的第一步吧。 第三板块：芋头老师访谈 作为本场活动特邀的嘉宾，心理学专家芋头老师为我们做了精彩的点评和总结。 聆听的重要性。放下身段，以平等的态度去用心听取孩子的想法，对家长来说有认真思考和诚意调整的必要性的。 交流的技巧性。同样需要调整高度，尽量以开放的方式去和孩子沟通，打开孩子的心扉，打开孩子的话匣子。不要害怕冲突，只要最终能解决问题。 包容的必要性。自己降低高度的同时也要正视孩子高度的提升。这个意义上，CEO和出资人更多意义上只是技术角度的比喻，切不能演变为资本家与打工人的关系。 家长要在孩子不同的生命阶段在合适的时间、场合做到进退有度，特别在孩子成长过程中保持平等、包容、接纳的心态。缺乏信任才会导致过度控制，家长也要保持学习的习惯，不断调整自己。 交流的四个层次：打招呼、谈事实、讲观点、聊感受。随着四个层次的不断深入，情感也就得到了强化升华，也就能敞开心扉、充分交流了。 父母要认识到自己的有限，社会瞬息万变，孩子也在时刻成长，保持开放的心态，学会陪伴孩子一起成长。 避免孩子一边接受一边抱怨以及父母一边付出一边指责。 ...... 芋头老师字字珠玑，不能在此概括于万一，我们期待能有更多的机会就更多话题展开更深入的交流。 写在最后 孩子们不时亮起的星星眼是给活动主办者最好的鼓励，家长们全场的关注和热烈的讨论是给活动本身最好的支持。 我们希望这样的活动能在孩子和家长们的鼓励和支持下发展壮大，最终成为孩子升学路上、成长路上的一座坚实桥梁、一个避风港湾、一个向星辰大海出发的起点......","categories":[{"name":"升学","slug":"升学","permalink":"http://justinwu1973.github.io/categories/%E5%8D%87%E5%AD%A6/"}],"tags":[{"name":"分享","slug":"分享","permalink":"http://justinwu1973.github.io/tags/%E5%88%86%E4%BA%AB/"}]},{"title":"董事会关于2020/12/20CEO第一次述职报告的审议意见","slug":"20-12-20MeetingRecord","date":"2020-12-20T18:19:00.000Z","updated":"2020-12-20T18:31:53.353Z","comments":true,"path":"2020/12/21/20-12-20MeetingRecord/","link":"","permalink":"http://justinwu1973.github.io/2020/12/21/20-12-20MeetingRecord/","excerpt":"","text":"董事会关于2020/12/20CEO第一次述职报告的审议意见 述职报告是在初次接触并且没有事前辅导的情况下临场发挥，有所欠缺是不可避免的。 在本次述职报告的基础上，明显需要总结经验，做好下一次述职报告的准备。 建议在TP提供的会谈纪要的基础上，由CEO自行归纳述职报告的章程，按照章程制订日常工作要点和工作纪要制度。下次报告时可以按照章程自行组织报告内容，供董事会和监事会审查。 日常工作制度的建立，对于工作重点的梳理与明确，意义重大，对于企业的发展，意义也同样重大。建议CEO安排到最高优先级尽快执行。 董事会全体成员都拥有国企或外企中高层管理岗位经验，深知良好工作规范的重要性，为帮助CEO建立良好工作规范，建议对第一次述职报告进行复盘，重新形成一个文字版的简要报告，补足本次口头报告的不足之处。该任务可以安排为次优先级处理。 董事会敦促CEO以开放与重视的心态面对董事会及监事会对日常工作的审查。这既是实现企业短期目标不可或缺的部分，也是满足企业长远发展不可或缺的部分。从战术角度出发，是试炼；从战略角度出发，是积累。CEO应该从这两个方面去审视自己的日常工作态度，这一点非常重要。 董事会也在此郑重承诺，不粗暴干涉CEO日常工作的安排。良好工作制度也包涵了CEO自主权力的保障，希望CEO能善用权利。企业管理同样可以借鉴近期接触到的关于功利、自由与德性的哲学思考。董事会乐于与CEO就任何方面的问题展开有益的有建设性的讨论。 董事会关于CEO首次述职报告的审议意见同时报监事会审查。鉴于监事会同时兼任服务提供者，董事会建议CEO应当同时主动加强与监事会的联系交流，以取得日常工作从目标制订到过程实施再到目标实现的全过程的支持，在保持目前成绩的基础上，进一步扩大工作成果。","categories":[],"tags":[{"name":"升学","slug":"升学","permalink":"http://justinwu1973.github.io/tags/%E5%8D%87%E5%AD%A6/"}]},{"title":"古文观止笔记之一-春秋、左传及其他","slug":"20-12-19GWGZ-1","date":"2020-12-19T09:26:00.000Z","updated":"2020-12-19T10:00:26.558Z","comments":true,"path":"2020/12/19/20-12-19GWGZ-1/","link":"","permalink":"http://justinwu1973.github.io/2020/12/19/20-12-19GWGZ-1/","excerpt":"","text":"读书这么私人的事情，怎么能随便读给别人看？当然，有志于读书的年轻人，其实很多时候并不掌握读书的技巧，所以，传道，传授如何读书的道，其实是读书人的第一要务。读书，其实是一种思维方式的训练。一本书正经八百从头读到尾，被作者牵着鼻子遛了一大圈，他说什么你听什么，读完放回书架养蠹虫，过两天就忘了个精光，那这书也就白读了。那么书该怎么读？这就跟我一起来不那么正经地读一读古文观止吧。 前言春秋，到底是怎样的一部史书？缺乏古文知识的人们往往会被左氏春秋、榖梁春秋、公羊春秋弄得头昏，到底哪本是正宗春秋？我们在中文课和历史课上学到，春秋是孔子编撰的鲁国的编年体史书，记录了前722年到前468年间共254年的史事。但是怎么会出来这么些版本？而且每本都不大一样。孔子到底写了什么？关公又到底读的是哪本呢？ 经与传首先，请看一下正经孔子所著春秋的原文。隐公隐公元年经：（一之三）夏五月，郑伯克段于鄢。下面呢？下面没有了。而且这个是真没有了。嗄？难道我们中学里学到的郑伯什么的是假的春秋？是的，其实我们中学里学到的是春秋的传。所谓传，就是对春秋原文的解释。因为解释者的不同，文体也就不同，甚至内容也大相径庭。所以，《古文观止》中有两篇郑伯，开首第一篇即左传中的郑伯，另一篇则是榖梁传中的郑伯。这两篇都不是孔子写的。 左传由来左传，相传为左丘明所作，左老先生何许人也？姜姓，丘氏，名明，前502-前422。说到姓氏，扯一下闲篇，依稀记得在哪本书上看到一个国学大家说屈原姓熊，因为太史公说：屈原者名平，楚之同姓也。而楚，就姓熊。这又昏了，楚王家公主嫁到秦国去的那个著名的芈月，怎么不叫熊月？其实先秦时候贵族都有姓有氏，姓是血缘，氏是官称。楚王姓芈，他的氏才是熊，只有当了楚王，才能称熊。那屈原就姓芈，氏屈，所以没有熊平，只有屈平。左老先生可能是姜太公后裔，所以祖上籍贯应该是齐国人，祖传职业就是史官，他爷爷在楚国干过左史，所以加了个左字算尊敬他的祖宗，他的老祖宗是姜太公第三子丘穆公吕印，所以以国为氏，叫丘明，这就是左丘明的来历。他本人职业是鲁国的太史，著作有左传和国语两种，国语我们会在后来的文章中另做介绍。左先生跟孔老夫子（前551-前479）算是个忘年之交，比夫子小了51岁，跟夫子一起去周朝图书馆查过资料，跟夫子同好恶，志趣相投，一起抠着脚丫子骂过同一个人。晚年失明，联系到太史公，说明搞历史的最后都得落下点残疾什么的，年轻人千万要慎重规划职业生涯。背景就介绍这么多，对左老先生有兴趣的，我们另找机会。 言归正传言归正传。你看，老话没有不正经的，连言归正传都归的是传而不是经。为什么，这个经实在有点不正经。就那么一句郑伯克段于鄢就来个下面没有了，叫人怎么明白什么意思？打住，老夫子说了，我们是属于中央档案馆编制，一般人我不写给他看的。想听故事？你们找别人去。这时候，专业历史从业人员就该登场了。左老先生就是干这行的，而且就是鲁国专业干这行的。后代儒生最喜欢说孔老夫子述而不作，大概是在抱怨夫子没正经，一句话就打发了后世几百代弟子。其实，春秋是不是夫子所作也没个定论，人家毕竟是官方历史档案，不能当故事会来写，某年，某人干了什么事，写成这样那叫格式。夫子到周朝国家图书馆和国家礼宾司，凡事都问，讲究的就是一个礼，怎么可能给你写故事会看着玩呢？所以故事会的重任就落到了夫子的小朋友左丘明的肩膀上。他得负责把档案解释给后代听：到底发生了什么？来来来，搬个小板凳，我左瞎子要开讲了啊......看来说书的都得戴墨镜，那也是历史悠久了啊......鉴于故事会模式比较长，我就跳过了这个部分。反正就是郑伯庄公按照舜的做法，培育了弟弟共叔段和亲生老娘的罪恶势力，等到罪恶滔天捂不住了，才去正大光明干掉了亲生弟弟，还把亲生老娘关起来，声称不到黄泉不相见。然后就后悔了，挖了个地道冒充黄泉跟老娘相见。这里出了两个成语，一个叫其乐融融，是庄公钻地道时候唱的歌。另一个叫融融泄泄，是庄公跟老娘对歌的内容。左老先生讲了一大篇故事，照例要解释一下，正经上那六个字是怎么个述而不作的。段的作为不象亲生弟弟，所以直呼其名。兄弟搞内讧，象两国争霸，所以称克，这就是国家之间征战克敌的意思。郑伯之所以称其爵位伯，是嘲笑他不管教弟弟任其走上犯罪道路。就这一段，我们跟穀梁传比较一下。榖梁传不是故事会，是文献组的架势。不跟你来茶馆的那套，直接写的是历史论文参考消息。克是什么意思？克就是能！能干嘛？能杀人。为啥不直接说杀，因为共叔段有一帮小弟，这就是打仗。于鄢是啥意思？你们自己去看地图，鄢那地方可远了......这大逃杀上演得还真早啊。郑大应该怎么追杀郑二呢？应该“缓追逸贼，亲亲之道也”。兄弟两个应该一起练长跑，Catch me if you can。最起码你看人家舜，自己在中原当老大，他兄弟象跑哪儿去了？跑广西去了（这个故事以后再说）。老大追不动了，老二也跑不动了，那就亲亲了。不过，舜是圣人，三皇五帝啊，他的坏话不能讲，得拼命圆，所以舜就成了大孝子，好大哥。而郑伯就在那儿挨了两千多年的批判，直到今天还在被广大中学生传诵。我手上没有公羊传的原文，等找到了以后再看看，不知道公羊传会有什么差别。不过相信大家也看出来了吧？故事会风格的纪实文学和新华社风格的评论员文章，都是好文章嘛。 写在最后但是，我写文章总有但是。但是，鉴于左丘明老先生跟夫子是忘年交，两个人还一起旅行过，一起泡过图书馆，所以我推测，左小和孔老应该就历史书怎么写作过亲切而深入的交流。身为春秋晚期的鲁国人，左小对自己家传的事业甚至于可能是自己写下的档案的阐发和故事会模式应该比较更接近历史现实。而与夫子的交流很可能就渗透在了左传的文字里了。而相传战国时候鲁国（前256年灭于楚国）人榖梁赤写的榖梁传，已经离春秋200多年了。不管是中央档案馆还是地方县志馆，已经让路给王霸事业，不再是当年的学术圣地了。读书人都忙着纵横，谁会老想着历史呢？那么后代学人对经文的阐发，是不是就更大可能掺杂了自己的理解而偏离了原文，不是述而不作，而是拼命作了呢？这一点，后代儒家弟子大概心里都有数吧？所以，不管是公羊还是榖梁，没有被列为五经，而左传却成为四书五经之一，公务员考试必考科目，说明儒家弟子还是有一点正经的。 结语历史应该怎么读？古文应该怎么读？我会在古文观止读书笔记里展示非主流的读书方法，结合时间轴和地图，提纲挈领，抽丝剥茧，告诉你一篇篇古文背后的故事。","categories":[{"name":"读书笔记","slug":"读书笔记","permalink":"http://justinwu1973.github.io/categories/%E8%AF%BB%E4%B9%A6%E7%AC%94%E8%AE%B0/"}],"tags":[{"name":"古文观止","slug":"古文观止","permalink":"http://justinwu1973.github.io/tags/%E5%8F%A4%E6%96%87%E8%A7%82%E6%AD%A2/"}]},{"title":"Mermaid流程图应用","slug":"20-12-18Mermaid","date":"2020-12-17T16:00:00.000Z","updated":"2020-12-18T07:22:48.049Z","comments":true,"path":"2020/12/18/20-12-18Mermaid/","link":"","permalink":"http://justinwu1973.github.io/2020/12/18/20-12-18Mermaid/","excerpt":"","text":"Mermaid是Markdown语法中另一个有用的插件，可以制作流程图、甘特图、饼图等图表。 Mermaid写法 基本代码如下，类似代码块写法。 第一行启动mermaid，第二行指定类型，第三行开始代码，结束行。 1234​```mermaidflowchartA---B​``` 显示效果： 12flowchartA---B 流程图 语法： 12345678910​```mermaidflowchart TBA[8月&lt;br&gt;雅思基础段]--&gt;B([9月&lt;br&gt;雅思6.5分段])--&gt;C[[次年1月&lt;br&gt;期末测试]]--&gt;D[(2-3月&lt;br&gt;刷题)]D--&gt;E&#123;4月&lt;br&gt;首考&#125;E--通过--&gt;F[9月&lt;br&gt;正式考]E--不通过--&gt;H((跑出去玩了))E--不通过--&gt;G[/重新刷题\\]--&gt;FH &lt;-.-&gt;|玩个痛快| I(走好不送)F ==&gt;H​``` 效果如下： 12345678flowchart TBA&gt;8月&lt;br&gt;雅思基础段]--&gt;B([9月&lt;br&gt;雅思6.5分段])--&gt;C[[次年1月&lt;br&gt;期末测试]]--&gt;D[(2-3月&lt;br&gt;刷题)]D--&gt;E&#123;4月&lt;br&gt;首考&#125;E--通过--&gt;F(9月&lt;br&gt;正式考)E--不通过--&gt;H((跑出去玩了))E--不通过--&gt;G[&#x2F;重新刷题\\]--&gt;FH &lt;-.-&gt;|玩个痛快| I(走好不送)F &#x3D;&#x3D;&gt;H 图形和线条还可以有更多变化，而且还并列几个流程，流程之间还可以交叉...... 饼图 语法： 12345678​```mermaidpietitle 中午饭吃点什么好呢？&quot;汉堡&quot;: 5&quot;披萨&quot;: 6&quot;皮肚面&quot;: 1&quot;西北风&quot;: 1​``` 效果如下： 123456pietitle 中午饭吃点什么好呢？&quot;汉堡&quot;: 5&quot;披萨&quot;: 6&quot;皮肚面&quot;: 1&quot;西北风&quot;: 1 写在最后 同学们在学习过程中可能上面的流程图和饼图会用到的多一些，所以在这里做了范例。 Mermaid图形渲染同样最好是通过主题支持，否则又可能会找一大圈找不到合适的解决方案。这里特别提醒注意。 https://mermaid-js.github.io/mermaid/#/ 这是Mermaid的网页，更多有趣的写法请在这里探索。","categories":[{"name":"Markdown","slug":"Markdown","permalink":"http://justinwu1973.github.io/categories/Markdown/"}],"tags":[{"name":"技巧","slug":"技巧","permalink":"http://justinwu1973.github.io/tags/%E6%8A%80%E5%B7%A7/"}]},{"title":"Markdown中数学公式的写法","slug":"20-12-16MathFuction","date":"2020-12-16T05:45:00.000Z","updated":"2020-12-16T17:25:15.706Z","comments":true,"path":"2020/12/16/20-12-16MathFuction/","link":"","permalink":"http://justinwu1973.github.io/2020/12/16/20-12-16MathFuction/","excerpt":"","text":"Markdown支持LaTeX数学公式语法，iPad上有支持编辑公式的软件，两者结合可以迅速制作公式。 Markdown内公式语法 Typora内建支持LaTeX语法，需要在偏好设置中选中，重启Typora后生效，就可以写入公式了。 公式前后用一个$，公式就显示在行内，用两个$，公式就显示为块。 示例： 1如果这么写$dx=\\int^&#123;\\infty&#125;_&#123;0&#125;\\frac&#123;x^&#123;m-1&#125;&#125;&#123;(1+x)^&#123;m+n&#125;&#125;dx)$那就会这样 显示：如果这么写\\(dx=\\int^{\\infty}_{0}\\frac{x^{m-1}}{(1+x)^{m+n}}dx\\)那就会这样 示例： 12345如果这么写$$\\beta \\left( m,n\\right) =\\int^&#123;1&#125;_&#123;0&#125; x^&#123;m-1&#125;\\left( 1-x\\right)^&#123;n-1&#125; \\ dx=2\\ int^&#123;\\pi /2&#125;_&#123;0&#125; \\ sin^&#123;2m-1&#125;x\\ cos^&#123;2n-1&#125;x\\ dx=\\int^&#123;\\infty &#125;_&#123;0&#125; \\frac&#123;x^&#123;m-1&#125;&#125;&#123;(1+x)^&#123;m+n&#125;&#125; dx）$$那就会这样 显示： 如果这么写 \\[ \\beta\\left(m,n\\right)=\\int^{1}_{0}x^{m-1}\\left(1-x\\right)^{n-1}\\ dx=2\\int^{\\pi/2}_{0}\\sin^{2m-1}x\\cos^{2n-1}x) \\] 那就会这样 在实际应用过程中发现不是所有主题都支持LaTex语法渲染，pure主题就是怎么修改都无法在网页上正常显示公式。最终只能放弃，改换fluid主题，可以自行搜索安装。fluid主题没有微信分享功能，忍痛割爱。 当然，也可以通过https://makergyt.github.io/markdown-it-latex2img/ 这个网页把LaTex公式转换成图片直接粘贴到文档里。效果如下，可以比较一下公式与图片的利弊。 显示： 如果这么写HTML 那就会这样 顺便说一下，代码块和公式块写法。 代码块首行用三个反引号，就是ESC键下面那个跟“ ~ ”在一起的键。结束也是一样。 公式块用的两个$$也是要单独成行的，否则就跟行内公式没有区别。 在行内使用特殊字符会自动转换，比如$xyz​$，会变成行内公式，如果不想它变成公式，那就要在$前面加上反斜杠，每个$前面都要加，使用反引号也可以，但是会把反引号里的内容变成行内代码块，比如$xyz$. 下图就是上面这个段落的源代码。 iPad里公式编辑软件推荐 iPad上有一些免费或付费的公式编辑软件，有手绘公式的也有键盘输入的。一般不推荐手绘公式，上图中那些π呀int符号在手绘过程中经常被误认，可能公式没画完人就已经疯了。所以还是推荐下面这个键盘输入的xFomula，30块，少喝一杯奶茶就有了，受益终身。 注意到APP里符号字母和数学公式的形态还是相当全的，探索一下键盘还挺有趣的。 最右下角的那个图片按钮，点进去可以选LaTeX公式导出或者直接图像导出，拷贝后可以直接在Mac上粘贴到Markdown文档中去，非Mac的同学也可以尝试其他方式，据说最近有发布跨iOS和win平台的复制粘贴APP。 写在最后 照例要写在最后。 接触LaTeX语法其实早在两三年之前了，初中的老师要求做错题整理甚至给张报纸让把其中的一些题目编辑成Word文档的电子试卷。绝大部分家长都懵圈，少部分家长尝试用扫描和文字识别，但是碰到公式就基本没辙了。 于是在iPad上的App Store里找数学公式软件，很愉快地一路把公式做进Word里。 走到了Markdown，没有理由不把这个经验分享给同学们。同时，首次在Markdown中使用LaTeX语法，在写作这篇文档的时候，进一步感受到了Word这样的文档写作老坦克是如何的笨重，而==Markdown==是如何能让写手更专注于内容本身。","categories":[{"name":"Markdown","slug":"Markdown","permalink":"http://justinwu1973.github.io/categories/Markdown/"}],"tags":[{"name":"技巧","slug":"技巧","permalink":"http://justinwu1973.github.io/tags/%E6%8A%80%E5%B7%A7/"}]},{"title":"观雪","slug":"20-12-15watchingsnow","date":"2020-12-14T23:54:00.000Z","updated":"2020-12-14T23:55:29.036Z","comments":true,"path":"2020/12/15/20-12-15watchingsnow/","link":"","permalink":"http://justinwu1973.github.io/2020/12/15/20-12-15watchingsnow/","excerpt":"","text":"《观雪》-----杨万里 坐看深来尺许强，偏於薄暮发寒光。 半空舞倦居然嬾，一点风来特地忙。 落尽琼花天不惜，封它梅蕊玉无香。 倩谁细橪成汤饼，换却人间烟火肠。","categories":[{"name":"散文","slug":"散文","permalink":"http://justinwu1973.github.io/categories/%E6%95%A3%E6%96%87/"}],"tags":[{"name":"摘抄","slug":"摘抄","permalink":"http://justinwu1973.github.io/tags/%E6%91%98%E6%8A%84/"}]},{"title":"GitHub搭建过程中使用pure主题时遇到的问题与解决方案","slug":"20-12-14Pure主题中遇到的问题及解决方案","date":"2020-12-13T16:00:00.000Z","updated":"2020-12-14T15:49:38.661Z","comments":true,"path":"2020/12/14/20-12-14Pure主题中遇到的问题及解决方案/","link":"","permalink":"http://justinwu1973.github.io/2020/12/14/20-12-14Pure%E4%B8%BB%E9%A2%98%E4%B8%AD%E9%81%87%E5%88%B0%E7%9A%84%E9%97%AE%E9%A2%98%E5%8F%8A%E8%A7%A3%E5%86%B3%E6%96%B9%E6%A1%88/","excerpt":"","text":"更换主题需要一定的技能，是个坑比较多的环节，但是完成这个任务，不但有成就感，而且会对GitHub搭建维护有更深的理解。 使用pure主题中遇到的问题 搭建完基础的landscape主题，会发现主题上能使用的功能比较少。标签、分类、about这些页面都没有，只有一个主页和一个归档。可能有些同学就会觉得太单调，从网页角度上来说，如果招生官或招聘人员进来看了，也会觉得一大堆文章都排在一起，想要找到目标文档是个麻烦的事情。所以，才会有更改主题的需求。 主题很多，有的同学选择next，有的同学会选择其他，我则选择了pure。原因是这个主题除了简洁之外，功能相对比较全，集成了主页、归档、分类、标签、about，和其他两个一般用不上的，还可以进行搜索、分享、评论、打赏、链接等等。 这些功能里，最常用也最有用的就是分类与标签，about基本不会总去修改，但是放在那里作为自我介绍也可以。 pure主题把这几个东西放在了menu里，操作非常简单。 更换主题的操作部分和设置部分就跳过不说，只说设置完会发生的问题。 这里的问题就是hexo g之后用hexo s在本地运行的时候，会发现分类、标签、仓库、关于的这四个标签都不能用。显示 Can't get /categories这样的信息。 这不是设置错误也不是脚本错误，这是页面丢失的信息。 解决方案 既然是找不到页面，那就先看一下什么是页面。 在博客根目录下的source里，刚搭建完的同学是没有上图中about及以下的四个目录的，这几个目录其实就是上面丢失的页面。每个目录里都有一个index.md文件。 新建这四个文件夹（忽略pics，这是存放上传图片源文件的位置，今后说到图片上传的时候才会用到 ）。使用hexo new page \"name\" 命令即可。注意文件夹名称的大小写。就会自动生成文件夹及其中的index文件。 看一下里面的内容，注意到第二行就是layout名称了。这里也要区分大小写。然后分别去设置好 这些做完，pure主题的menu就都可以用了。 about页面里的内容是可以随便写的，也不用标明layout。 当然，也可以尝试继续新建页面。在menu那部分设置里加上就可以，但是显示出来会比较别扭，页面标题前面会多个menu字样，这个可能在别的主题里不一定会有，应该是主题作者开发时候留下的尾巴。 写在最后 在更换主题的过程中，特别是新手小白学生党，很可能会遇到各种问题，应该利用好解惑群，除了搭建博客的基础阶段，使用的过程中也还会有各种问题出现，有人踩坑，有人填坑，分享经验就能替后人节省很多时间。 解决这个问题的过程：1、在landscape的时候就尝试了about页面的新建和使用。2、在试用其他主题的过程中也有用到categories和tags，所以在使用pure主题之前已经建立了categories和tags文件夹。3，我自己遇到的问题就是categories文件夹名称错误的问题。4、在给女儿排除障碍的时候发现四个菜单都用不起来。5、比对过程中发现女儿电脑上没有这四个文件夹。6、找到源头，问题解决。 说穿了就非常简单，不需要老师也能自己找到解决方案，可能需要的就是一点点经验和联想力吧。当然，经验这个东西就不是一天两天能积累得起来的了，而且有些经验说不清道不明，可能是很多跨界的经验碰撞组合后形成的，这个说来话就长了......","categories":[{"name":"GitHub","slug":"GitHub","permalink":"http://justinwu1973.github.io/categories/GitHub/"}],"tags":[{"name":"技巧","slug":"技巧","permalink":"http://justinwu1973.github.io/tags/%E6%8A%80%E5%B7%A7/"}]},{"title":"不寐听雨","slug":"20-12-14不寐听雨","date":"2020-12-13T16:00:00.000Z","updated":"2020-12-13T23:45:52.913Z","comments":true,"path":"2020/12/14/20-12-14不寐听雨/","link":"","permalink":"http://justinwu1973.github.io/2020/12/14/20-12-14%E4%B8%8D%E5%AF%90%E5%90%AC%E9%9B%A8/","excerpt":"","text":"《不寐听雨》-----杨万里 雨到中霄寂不鸣，只闻风拂树梢轻。 瓦沟收拾残零水，并作檐间一滴声。","categories":[{"name":"读书笔记","slug":"读书笔记","permalink":"http://justinwu1973.github.io/categories/%E8%AF%BB%E4%B9%A6%E7%AC%94%E8%AE%B0/"}],"tags":[{"name":"摘抄","slug":"摘抄","permalink":"http://justinwu1973.github.io/tags/%E6%91%98%E6%8A%84/"}]},{"title":"Mac环境中利用模板自动生成新博客文章","slug":"20-12-12Mac中自动利用模板生成新博客","date":"2020-12-11T16:00:00.000Z","updated":"2020-12-12T15:03:21.090Z","comments":true,"path":"2020/12/12/20-12-12Mac中自动利用模板生成新博客/","link":"","permalink":"http://justinwu1973.github.io/2020/12/12/20-12-12Mac%E4%B8%AD%E8%87%AA%E5%8A%A8%E5%88%A9%E7%94%A8%E6%A8%A1%E6%9D%BF%E7%94%9F%E6%88%90%E6%96%B0%E5%8D%9A%E5%AE%A2/","excerpt":"","text":"Mac平台之所以凶猛，就是因为有很多实用的功能没有放到表面上来。 标题中提到的功能，一般人都不知道该用什么方法来实现，只能老老实实进入终端去hexo n。说实话，没事就挂个终端窗口冒充码农可能是有一点阴暗的心理快感的，但也就仅此而已。 今天就介绍一下“自动操作”这个Mac原生软件。 软件 有苹果的小朋友可以自己进去摸索一下。 流程 因为这个步骤很简单，就是在哪个地方放个模板，然后找到它，复制它，重命名，三个步骤就完成了。 需要提醒的是，新建工作流的时候请选择应用程序，完成之后就可以拖到桌面或者程序坞，想写文章的时候就一键直达了。记得工作流走到重命名这一步的时候在选项中选择显示此操作，要不然命名就自动走过去了，不会让你输入文件名的哦。 啊哈，还忘记了一个流程。最后添加一个“打开访达项目”的流程，就直接打开新建的文件了，真正做到一键新建文档了哦。至于怎么操作，有了上面的基础，应该完全没问题了吧？","categories":[{"name":"GitHub","slug":"GitHub","permalink":"http://justinwu1973.github.io/categories/GitHub/"}],"tags":[{"name":"技巧","slug":"技巧","permalink":"http://justinwu1973.github.io/tags/%E6%8A%80%E5%B7%A7/"}]},{"title":"Markdown上下标写法","slug":"20-12-11Markdown上下标写法","date":"2020-12-10T16:00:00.000Z","updated":"2020-12-11T16:58:20.849Z","comments":true,"path":"2020/12/11/20-12-11Markdown上下标写法/","link":"","permalink":"http://justinwu1973.github.io/2020/12/11/20-12-11Markdown%E4%B8%8A%E4%B8%8B%E6%A0%87%E5%86%99%E6%B3%95/","excerpt":"","text":"Markdown语法中上下标写法 语法: A&lt;sub&gt;b&lt;/sub&gt; 显示效果：Ab 语法：A&lt;sup&gt;b&lt;/sup&gt; 显示效果：Ab","categories":[{"name":"Markdown","slug":"Markdown","permalink":"http://justinwu1973.github.io/categories/Markdown/"}],"tags":[{"name":"技巧","slug":"技巧","permalink":"http://justinwu1973.github.io/tags/%E6%8A%80%E5%B7%A7/"}]},{"title":"狗","slug":"20-12-11狗","date":"2020-12-10T16:00:00.000Z","updated":"2020-12-11T16:57:43.073Z","comments":true,"path":"2020/12/11/20-12-11狗/","link":"","permalink":"http://justinwu1973.github.io/2020/12/11/20-12-11%E7%8B%97/","excerpt":"","text":"​ 总共就见过三次“狗”。 “狗”是乡下奶奶的，土狗，没名字，就叫“狗”了。 第一次见“狗”，奶奶还健旺，“狗”也还是小奶狗，满地撒欢两头乱蹿地玩得不亦乐乎。谁喊“狗”都要扑过来确认一下再猛摇尾巴扑向下一个。 第二次已是数年以后，奶奶已经卧病不起了。那天正下雨，我们去的时候，看见“狗”垂头丧气地蹲在后门口看着雨帘发呆，喊“狗”，半晌才漠然回头看一眼，眼神也没了焦点。 ​ 奶奶终于过世了。于是也见了“狗”最后一次。居然是在餐桌上了。我疑惑犹豫地轻声喊：“狗？”仿佛依稀听到它精神抖擞地“汪”了一声，转身化作汤锅里的一缕英魂或芳魂。大伯二伯盛情邀我动手，然而我却不知怎的，呆呆的，下不去筷了。","categories":[{"name":"散文","slug":"散文","permalink":"http://justinwu1973.github.io/categories/%E6%95%A3%E6%96%87/"}],"tags":[{"name":"散文","slug":"散文","permalink":"http://justinwu1973.github.io/tags/%E6%95%A3%E6%96%87/"}]},{"title":"GitHub 博客搭建经验","slug":"20-12-09GitHub 博客搭建经验","date":"2020-12-09T06:54:18.000Z","updated":"2020-12-11T04:40:03.803Z","comments":true,"path":"2020/12/09/20-12-09GitHub 博客搭建经验/","link":"","permalink":"http://justinwu1973.github.io/2020/12/09/20-12-09GitHub%20%E5%8D%9A%E5%AE%A2%E6%90%AD%E5%BB%BA%E7%BB%8F%E9%AA%8C/","excerpt":"","text":"GitHub博客编写与主题 博客编写和主题 markdown语法 语法简单，可以边写边学。 - 列表 1. 无序列表 - 减号+空格 - 继续减号+空格 有序列表 数字+”.“加 继续数字+”.“加空格 列表中列表注意前方加空格 列表在不同软件中呈现效果不一 先输入完整列表标题，再展开内容写作。 注意列表标题及小标题层次。 换行继续输入文字自动结束列表 双星号加粗，单星号斜体 字号字体用html标签 数学公式用latex语法，不会的可以在iPhone或iPad上使用mathpad手绘公式，然后输出latex语法直接粘贴到md文档中去。 主题编辑 进入Hexo官网主题页面 找到喜欢的开源主题 进入主题 找到主题的网页地址 好心的主题开发者会在博客中留下主题安装的指引，跟着指引走就行。下载完整的主题可能需要很长时间，务必耐心。 终端中使用“git clone https://github.com/fi3ework/hexo-theme-archer.git themes/archer”命令，网址后面不要忘记加” .git “。最后的themes/archer是主题目录里的主题名称，可以自己命名，在config文件中保证名称一致即可。 打开博客目录中的config文件，编辑theme为主题名称。 打开主题目录中的config可以编辑菜单，不一定所有的主题都一样，这里只是示例。同样，好心的博主会留下主题设置的引导。 menu: #配置页头显示哪些菜单 Archives: /archives Reading: /reading About: /about about页面可以通过博客目录下 hexo new page “about” 建立。source文件夹中会建立一个about.md文件，直接进去输入内容即可。 终端回到博客目录，hexo g，hexo s，本地查看主题效果。进一步调整细节，即可发布。 终端可以开多个窗口，同时进行多个进程，比如一个窗口专门做hexo任务，同时另一个窗口可以一直在下载主题。 静态博客网页及主题编辑中遇到的问题和解决方案 如何选择主题 主题选择主要看功能，是否有菜单？文章列表是否清晰明了？首页文章呈现方式？是否能搜索？是否能分类？是否能标签？是否能评论？一切以简捷实现功能为要。 主题选择还要看主题作者是否提供主题安装的引导，有的主题虽然好看，但是po主不知道把引导放在哪里，那么要针对功能进行个性化就很难。 有的主题首页只呈现文章标题，不显示文章内容，这个没法通过根目录与主题目录中的两个config文件进行调整，介意的同学请割爱。 博客根目录下的config文件中可以个性化的内容 博客根目录下config个性化内容，自上而下 title。默认hexo，可调整为自己喜欢的内容。 subtitle author language 默认en，可以调整为zh-CN，前提是themes/***/layout/languages/目录中有zh-CN语言包。 timezone 出国以后可以改，空着也无所谓 url 改成自己的主页路径 directory就是根目录下面放不同文件的子目录，有时候会莫名出现路径错误，对照一下是否一致。 default_category 默认uncategorized，可以修改为自己喜欢的分类，管理文章的时候方便。 文章建立分类和标签要在title下面添加“ categories: - name ”和“ tags: - name ”语句。 theme 这个是肯定要修改的，theme目录下会出现多个theme也很正常，修改主题目录名称以便管理，这里就要相应修改。 博客根目录下文件个性化 /source/_posts/ 这个文件夹就是存放文章的地方，可以用hexo new “名称”的命令新建文章，要修改文章就在这里找，不支持文件夹。 /source/about/ 这个文件夹里的index文件是存放about内容的，直接编辑内容即可。 主题根目录下config文件中可以个性化的内容 themes目录中config个性化内容，主题不同，config的内容就不同，这里以本博使用的pure主题为例，可以自行研究。 https://github.com/cofess/hexo-theme-pure 这是主题的路径。 menu 可以用#放在行首隐藏不需要的menu，注意不要随意修改导致名称不一致，包括大小写，后续可能会无法使用menu title 页面标题 board 站点公告，放在首页的介绍、通知之类 copyright skin layout toc 这些都是pure主题开发者自己设计的内容，其他主题会不一样，看到了可以研究研究效果，hexo g然后hexo s，然后就可以在本地浏览器上测试。 archive_type 默认“monthly”，可以改成按天还是按年，可以自行测试。 share pure作者还贴心地安排了分享按钮，可以自行调整。 github 不管在哪里看到这个，先把自己的GitHub账号拿出来填进去 评论部分专题说 avatar 不一定每个主题都象pure作者这样分类清晰，有的就把avatar放在别处，但是avatar是博客上显示的头像，找到主题目录下source/images/，在里面放上自己的头像，然后avatar: images/***.jpg。 author author title author_description location 出国以后要改 follow 吸引一下小伙伴吧 social link 不想填那么多就#掉一些 主题目录下文件个性化 语言包 语言包yml文件内容很简单，冒号前面是功能，冒号后面是显示出来的字样，home;home，就是首页显示为home，改成home:首页，就呈现为中文“首页”。想搞怪可以在这里编辑一些吓人的内容。 上文提到可以在根目录config中修改语言，实测没有效果，所以变通的方法就是修改语言包，我就是把en和cn-ZH两个文件名互换了，国高学生的blog是有目的性的，不建议过分个性化。等以后社会人了再尝试个性化也可以。 有的主题是有head图片和其他图片的，可以在images里找到并替换成自己的图片。 ejs类文件不要乱改，除非有网页设计经验。 重点说一下评论框 请使用gitalk。重要的事情说三遍：不要尝试其他！不要尝试其他！不要尝试其他！都不能用了。 https://www.cnblogs.com/qisi007/p/13731562.html 教程在此。 跟着教程走，基本没问题。但是最后一步article.ejs文件中添加代码，这一步要跳过。会影响到博客部署后的效果，出现一张白纸之类的。但也有可能是不同主题设计的差异，根据自己选择的主题进行设置。如果主题中不包含评论框，就不要花时间去研究了，另外找一个带评论框的主题进行设置吧。pure主题中包含了多个评论框的设置，调节起来比较方便。 Summary 从接到任务开始到全部完成GitHub的搭建，总共花费了约36个小时，不断踩坑是最主要的费时因素。 从零开始搭建GitHub对高中生里占大多数的计算机素人来说是个很严峻的挑战，文件目录系统与文件命名规则的了解与熟悉，命令行操作方式的了解与熟悉，代码的输入与逻辑，测试方法与debug的方法和逻辑，这个部分的思路培养其实是CS课上不会成体系教授的，需要花费一点时间来熟悉，一旦掌握了思路，很快就能驾轻就熟。 搭建GitHub博客的目的，对国高学生来说，目前就是升学。玩出花儿来也不过如此，切忌过分，最好能配合自己的升学方向做相应的调整，成为升学的助力。 主题发布者绝大多数会夹带私货，毕竟是个人的主题，所以会有一些奇怪的链接之类是我们不需要的，尽管删除，或者学着替换或加入自己的内容。 再次提醒：GitHub博客在国内毕竟还是小众，而且目的不是社交。作为文章库的存在，应该以写作为重心，关注的是内容。主题再花哨，不如一目了然。尤其是以升学文档为主体的国高学生，应该更重点关注的是markdown的写作方式。结构化写作，没有比markdown更适合的文本写作工具了。而latex之类数学公式的支持又使得理科生在绝望中看到一线曙光，配合iPad等平板电脑及Apple pencil等硬件工具，还有mathpad之类数学公式手写软件，再复杂的方程和公式也可以轻松以最直接自然的方式生成。 不是所有的家长都有相关经验，遇到问题可以选择向老师或学长咨询，有时间的可以自行研究，但是不建议花费太多时间去试错，网上搜索教程虽然也是一种方法，但是很多教程已经是几年前的内容了，很多东西已经过时，这种时候多问一句，可能会节省几个小时甚至更多。 关于markdown，为什么要强调结构化写作，这是一种非常好的实用写作方法。要写一篇实用文，先打个草稿或者腹稿，然后写出提纲，然后一段一段在提纲下写出内容。整篇文章就不会散乱或者偏楼。这种写作习惯在我们以往的教育中是体现为不同的体系的，与markdown的写作方法并不能很好兼容。尽快适应markdown的写作方法，对即将到来的文书写作是有很大的帮助的。另外，GitHub博客的后台对于文档管理也是有很大的帮助的，也需要尽快熟悉掌握。 最后，hexo d 部署上传会有一点delay，不一定马上就能在浏览器里刷新最新的结果，耐心等待一下，会有的。 最最后，苹果系统跨平台操作能力超强，有条件的一定要尝试一下，在iPad上写作，复制黏贴到Macbook上的文档里。iPad可以作为MacBook的第二块屏幕显示不同的桌面。终端可以开几个窗口，一边运行hexo s，一边运行hexo g，修改的内容可以即时在本地刷新查看效果，同时还可以写作。Mac的快捷键也一定要用，在终端里反复生成静态页面，可以用上箭头键，直接重复上一条命令，不用反复敲键盘了。cmd-c cmd-v cmd-z shift-cmd-z，这些快捷键都要熟悉，另外在搭建过程中会用到截屏、保存、新建、新开窗口等，都有对应的快捷键，可以在菜单里找到相应的快捷键。 ​","categories":[{"name":"GitHub","slug":"GitHub","permalink":"http://justinwu1973.github.io/categories/GitHub/"}],"tags":[{"name":"Blog building","slug":"Blog-building","permalink":"http://justinwu1973.github.io/tags/Blog-building/"}]},{"title":"Markdown学习笔记","slug":"20-12-08Markdown学习笔记","date":"2020-12-08T05:45:00.000Z","updated":"2020-12-16T08:12:02.673Z","comments":true,"path":"2020/12/08/20-12-08Markdown学习笔记/","link":"","permalink":"http://justinwu1973.github.io/2020/12/08/20-12-08Markdown%E5%AD%A6%E4%B9%A0%E7%AC%94%E8%AE%B0/","excerpt":"","text":"toc: true GitHub博客苹果平台搭建 1、GitHub设置 1、仓库建立时注意默认分支名称，在setting中需保持与config中一致。 2、网页链接中”用户名/用户名.github.io”不要忘记是连续两个用户名。 2、Mac平台软件 1、nodejs不要下载最新版本，直接进入以往版本下载12版pkg进行包安装，否则后面会报错。 2、注意文件夹目录。 3、出现权限错误，终端使用sudo命令取得权限。 4、出现无法部署的情况，可以清掉.git隐藏文件夹，hexo clean，检查type：等冒号后空格数量，对照网上比较新的教程，基本都能解决。 3、跨平台 1、iPad上可以使用多种免费或收费的markdown软件，通过“文件”编辑iCloud中的MD文件。 2、iPad上无法使用终端命令生成静态网页并部署，该步骤仍需回到Mac上操作，但是鉴于MacBook键盘的糟糕体验，专注于写作的时候不妨用iPad Pro加妙控键盘，非常舒服。 4、对学生党的建议 1、进行一项任务时，最好手边备个本子随手记录过程中碰到的问题和所有失败的解决方案，今后复盘时可以分析原因作为前车之鉴。 2、通过markdown的运用，养成良好的文章写作习惯：提纲、形式、内容。 Justin Wu","categories":[{"name":"Markdown","slug":"Markdown","permalink":"http://justinwu1973.github.io/categories/Markdown/"}],"tags":[{"name":"技巧","slug":"技巧","permalink":"http://justinwu1973.github.io/tags/%E6%8A%80%E5%B7%A7/"}]},{"title":"Hello World 插件仓库","slug":"20-12-07hello-world","date":"2020-12-07T14:19:31.541Z","updated":"2020-12-18T17:28:04.969Z","comments":true,"path":"2020/12/07/20-12-07hello-world/","link":"","permalink":"http://justinwu1973.github.io/2020/12/07/20-12-07hello-world/","excerpt":"","text":"代码 1234567891011121314151617181920212223242526272829303132333435363738394041424344&lt;p class=&quot;note note-primary&quot;&gt;这是一个标签&lt;br&gt;这是标签的第二行&lt;/p&gt;&#123;% note success %&#125;这是另一个标签&lt;br&gt;这是另一个标签的第二行&#123;% endnote %&#125;&#123;% note primary %&#125;样式primary&#123;% endnote %&#125;&#123;% note secondary %&#125;样式secondary&#123;% endnote %&#125;&#123;% note success %&#125;样式success&#123;% endnote %&#125;&#123;% note danger %&#125;样式danger&#123;% endnote %&#125;&#123;% note warning %&#125;样式warning&#123;% endnote %&#125;&#123;% note info %&#125;样式info&#123;% endnote %&#125;&#123;% note light %&#125;样式light&#123;% endnote %&#125;这是一个行内标签&#123;% label primary @行内标签 %&#125;&#123;% btn https://justinwu1973.github.io, 跳转到山水堂, 山水堂 %&#125;&#123;% btn https://hexo.fluid-dev.com/docs/guide/, 跳转到Fluid指南, Fluid指南 %&#125;- [x] 打了一个勾- [ ] 没打一个勾 下一行文字。 标签HTML 这是一个标签这是标签的第二行 标签 这是另一个标签 这是另一个标签的第二行 标签样式 样式primary 样式secondary 样式success 样式danger 样式warning 样式info 样式light 行内标签 这是一个行内标签行内标签 按钮演示 跳转到山水堂 跳转到Fluid指南 CheckBox 打了一个勾 没打一个勾 写在最后 最后。","categories":[{"name":"GitHub","slug":"GitHub","permalink":"http://justinwu1973.github.io/categories/GitHub/"}],"tags":[{"name":"技巧","slug":"技巧","permalink":"http://justinwu1973.github.io/tags/%E6%8A%80%E5%B7%A7/"}]}],"categories":[{"name":"分享","slug":"分享","permalink":"http://justinwu1973.github.io/categories/%E5%88%86%E4%BA%AB/"},{"name":"升学","slug":"升学","permalink":"http://justinwu1973.github.io/categories/%E5%8D%87%E5%AD%A6/"},{"name":"读书笔记","slug":"读书笔记","permalink":"http://justinwu1973.github.io/categories/%E8%AF%BB%E4%B9%A6%E7%AC%94%E8%AE%B0/"},{"name":"Markdown","slug":"Markdown","permalink":"http://justinwu1973.github.io/categories/Markdown/"},{"name":"散文","slug":"散文","permalink":"http://justinwu1973.github.io/categories/%E6%95%A3%E6%96%87/"},{"name":"GitHub","slug":"GitHub","permalink":"http://justinwu1973.github.io/categories/GitHub/"}],"tags":[{"name":"教育","slug":"教育","permalink":"http://justinwu1973.github.io/tags/%E6%95%99%E8%82%B2/"},{"name":"亲子","slug":"亲子","permalink":"http://justinwu1973.github.io/tags/%E4%BA%B2%E5%AD%90/"},{"name":"分享","slug":"分享","permalink":"http://justinwu1973.github.io/tags/%E5%88%86%E4%BA%AB/"},{"name":"升学","slug":"升学","permalink":"http://justinwu1973.github.io/tags/%E5%8D%87%E5%AD%A6/"},{"name":"古文观止","slug":"古文观止","permalink":"http://justinwu1973.github.io/tags/%E5%8F%A4%E6%96%87%E8%A7%82%E6%AD%A2/"},{"name":"技巧","slug":"技巧","permalink":"http://justinwu1973.github.io/tags/%E6%8A%80%E5%B7%A7/"},{"name":"摘抄","slug":"摘抄","permalink":"http://justinwu1973.github.io/tags/%E6%91%98%E6%8A%84/"},{"name":"散文","slug":"散文","permalink":"http://justinwu1973.github.io/tags/%E6%95%A3%E6%96%87/"},{"name":"Blog building","slug":"Blog-building","permalink":"http://justinwu1973.github.io/tags/Blog-building/"}]}